/**
 * 功能：
 * @authors mmklzmant (mmklzmant@163.com)
 * @date    2017-08-21 21:36:08
 */

/*************************************************/
/* 全局变量、对象定义部分 */
/*************************************************/


/*************************************************/
/* 页面加载完成之后执行的功能 (函数目录)*/
/*************************************************/
window.onload = function() {
	// ==============================
    // 功能流程
    // ==============================
	// 头部导航栏拖动
	dragerNav();

    // ==============================
    // 全局功能工具函数
    // ==============================
}


/*************************************************/
/* 功能函数及方法定义部分 (函数内容)*/
/*************************************************/
function dragerNav(){
	/*transform: translate(-150px, 0);*/
	/*var start;
	var end;
	var nav = document.getElementsByClassName("home-nav")[0]
			.getElementsByTagName("ul")[0];
	nav.addEventListener("touchmove", function(e){
		this.style.transform = "tanslate(-150px, 0);";
		console.log(this.style.transform);
	}, false);*/
}